In [1]:
import pandas as pd
from IPython.display import Image

In [2]:
Image(url='http://cumatrixfile.cupoy.com/00000176E0E79AFC000000186375706F795F72656C656173654349/marathon/1610076223237')

# HW

In [3]:
#題目 : 運用下列分數資料分析 


score_df = pd.DataFrame([[1,50,80,70,'boy',1],[2,60,45,50,'boy',2],
                         [3,98,43,55,'boy',1],[4,70,69,89,'boy',2],
                         [5,56,79,60,'girl',1],[6,60,68,55,'girl',2],
                         [7,45,70,77,'girl',1],[8,55,77,76,'girl',2],
                         [9,25,57,60,'girl',1],[10,88,40,43,'girl',3],
                         [11,25,60,45,'boy',3],[12,80,60,23,'boy',3],
                         [13,20,90,66,'girl',3],[14,50,50,50,'girl',3],
                         [15,89,67,77,'girl',3]],
                        columns=['student_id','math_score','english_score','chinese_score','sex','class'])

In [4]:
score_df.head()

   student_id  math_score  english_score  chinese_score   sex  class
0           1          50             80             70   boy      1
1           2          60             45             50   boy      2
2           3          98             43             55   boy      1
3           4          70             69             89   boy      2
4           5          56             79             60  girl      1

In [5]:
#找出全年級各科成績最高分與最低分？
score_df.groupby('class')['math_score','english_score','chinese_score'].agg(['max','min'])

      math_score     english_score     chinese_score
             max min           max min           max min
class
1             98  25            80  43            77  55
2             70  55            77  45            89  50
3             89  20            90  40            77  23

In [6]:
#找出數學班平均最高的班級？
score_df.groupby('class')['math_score'].agg(['mean'])

            mean
class
1      54.800000
2      61.250000
3      58.666667

In [7]:
#分析全校女生與男生國文平均差幾分？
score_df.groupby('sex')['chinese_score'].agg(['mean'])

           mean
sex
boy   55.333333
girl  62.666667